<?php

/* @var $this yii\web\View */

$this->title = 'Кращий молодий науковець НТУ "ХПІ"';
?>
<div class="site-index">

    <div class="jumbotron">
        <h1>Шановний науковець!</h1>
		<br/>
        <p class="lead">Вітаємо Вас на сайті інформаційної системи для проведення конкурсу<br/><br/>
						«Кращий молодий науковець НТУ «ХПІ».</p>
		<br/>
        <p><a class="btn btn-lg btn-success" href="rating">Рейтинг науковців</a></p>
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-6">
                <h3>Оголошено конкурс «Кращий молодий науковець року НТУ «ХПІ»</h3>

                <p>Для виявлення талановитої молоді та підтримки наукових досліджень
				молодих науковців НТУ «ХПІ», Рада молодих вчених оголошує конкурс 
				«Кращий молодий науковець року НТУ «ХПІ».<br/> Для участі у конкурсі необхідно до 29 квітня 2016 р.
				 заповнити форму для підрахунку рейтингової оцінки діяльності молодих науковців
				 та підготувати копії документів, які підтверджують наукові досягнення за рік, 
				 а також фотографію в електронному вигляді.</p>

                <p><a class="btn btn-default" href="http://blogs.kpi.kharkov.ua/v2/rmv/2016/04/10/konkurs-krashhij-molodij-naukovets-roku-ntu-hpi/" target="_blank">Рада молодих науковців &raquo;</a></p>
            </div>
            <div class="col-lg-6">
                <h3>Результати конкурсу «Кращий молодий науковець року НТУ «ХПІ»</h3>

                <p>Шановні колеги!<br/>За підсумками 2015 року абсолютним переможцем щорічного конкурсу «Кращий молодий науковець року НТУ «ХПІ»
				став — Заковоротний Олександр Юрійович, к.т.н., доцент кафедри обчислювальної техніки та програмування 
				факультету комп’ютерних та інформаційних технологій, докторант НТУ «ХПІ».</p>

                <p><a class="btn btn-default" href="http://blogs.kpi.kharkov.ua/v2/rmv/2016/05/27/rezultati-konkursu-krashhij-molodij-naukovets-roku-ntu-hpi/" target="_blank">Результати конкурсу &raquo;</a></p>
            </div>
            
        </div>

    </div>
</div>
